# coding: utf-8
# license: GPLv3


class Star:
    """Тип данных, описывающий звезду.
    Содержит массу, координаты, скорость звезды,
    а также визуальный радиус звезды в пикселах и её цвет.
    """

    type = "star"
    """Признак объекта звезды"""

    m = 0
    """Масса звезды"""

    x = 0
    """Координата по оси **x**"""

    y = 0
    """Координата по оси **y**"""

    Vx = 0
    """Скорость по оси **x**"""

    Vy = 0
    """Скорость по оси **y**"""

    Fx = 0
    """Сила по оси **x**"""

    Fy = 0
    """Сила по оси **y**"""

    R = 5
    """Радиус звезды"""

    color = "red"
    """Цвет звезды"""

    image = None
    """Изображение звезды"""


class Planet:
    def __init__(self, type='planet', m=0, x=0, y=0, Vx=0, Vy=0, Fx=0, Fy=0, R=0, color=''):
        """Тип данных, описывающий планету.
        Содержит массу, координаты, скорость планеты,
        а также визуальный радиус планеты в пикселах и её цвет
        """

        self.type = type
        """Признак объекта планеты"""

        self.m = m
        """Масса планеты"""

        self.x = x
        """Координата по оси **x**"""

        self.y = y
        """Координата по оси **y**"""

        self.Vx = Vx
        """Скорость по оси **x**"""

        self.Vy = Vy
        """Скорость по оси **y**"""

        self.Fx = Fx
        """Сила по оси **x**"""

        self.Fy = Fy
        """Сила по оси **y**"""

        self.R = R
        """Радиус планеты"""

        self.color = color
        """Цвет планеты"""

        image = None
        """Изображение планеты"""